# დავალება 3

# შემსრულებელი: გიორგი ცუცირიძე

# ეს დავალება მოგვცეს მესამე ლექციაზე, რომელიც ჩატარდა 20231204-ში
# და დავალების ჩაბარების ბოლო ვადაა 20231211.


## 2. გამრავლების ტაბულა

# ორმაგი for ციკლის_ის დახმარებით დაბეჭდე გამრავლების ტაბულა 1_დან 
# მომხმარებლის მიერ შეყვანილი მთელი რიცხვის ჩათვლით.

number = int(input("შეიყვანეთ მთელი რიცხვი: "))
table = "" # აქ ვასაწყობებს ცხრილს
heading = " |" # აქ ვასაწყობებ ცხრილის სათაურს
for i in range(1, number+1):    
    
    line = str(i) + "|"
    
    for j in range(1, number+1):

        if i == 1: # ეს ბლოკი ქმნის ცხრილის სათაურს

            heading += str(i*j) + "|"
    
        line += str(i*j) + "|"
    
    if i == 1: # ცხრილს უკეთებს სათაურს

        table += heading + "\n"

    table +=line + "\n"

print(table)


## 3. საბანკო ანგარიში

# შეადგინე პროგრამა რომელიც განასახიერებს საბანკო ანგარიშს. მასზე განთავსებულია
# თანხა 3000 ლარის ოდენობით. პროგრამა გეკითხება გაწეულ ხარჯს და აკლებს ანგარიშს
# მანამ, სანამ არ შეიყვან 0_ს. შემდეგ გიბეჭდავს ანგარიშზე დარჩენილ თანხას და წყვეტს
# ფუნქციონირებას. თუ ანგარიშზე არსებული თანხა ნაკლებია დანახარჯის თანხაზე,
# პროგრამამ უნდა დაბეჭდოს, რომ ანგარიშზე არ არის საკმარისი თანხა და გააგრძელოს
# ფუნქციონირება.

# რადგან ამოცანა ამის საშუალებას იძლეოდა ცოტათი პირობა დავხვეწე და მგონი
# რეალურთან უფრო მიახლოებული პროგრამა გამოვიდა.

account_balance = 3000

while True:
    
    expense = input("შეიყვანეთ თქვენი ხარჯი: ")

    while True: # ეს ბლოკი ჩავსვი იმისთვის, რომ მომხმარებელს არ შემოაყვანინოს
        # რიცხვის გარდა რაიმე სხვა სიმბოლო. არ იყო ამოცანის მოთოვნაში, მაგრამ მე
        # მგონი უფრო შესაბამისია პროგრამის საჭიროებებთან. 
        try:

            expense = float(expense) # თუ შემოიყვანს რაიმე რიცხვს მას გადააქცევს ათწილადად
            break # თუ ათწილადად წარმატებით გადაიქცა ეს ციკლი დასრულდება.
        
        except ValueError: #  თუ ათწილადად არ გადაიქცა მაშინ კიდევ ერთხელ თხოვს ხარჯის სწორად 
            # შემოყვანას და თან შეახსენებს წესებს.

            expense = input("გთხოვთ სწორად შეიყვანოთ თანხა" 
                            "(თანხა უნდა იყოს რაიმე დადებითი რიცხვი): ")

    if expense == 0: # თუ 0-ს შეიყვან პროგრამა დაასრულებს მუშაობას და გამოგიტანს
        # ანგარიშზე დარჩენილ თანხას
    
        print("ანგარიშზე დრჩენილია: ", account_balance)
        break
    
    elif account_balance < expense:

        print("ანგარიშზე არ არის საკმარისი თანხა!\nანგარიშზე დარჩენილია: ",
              account_balance)

    else:

        account_balance -= expense
        
        if account_balance == 0:
            print(f"ანგარიშზე თანხა ამოიწურა და შეადგენს {account_balance} ლარს")
            break

## 4. თუთიყუშის პროგრამა

# დაწერე პროგრამა _ თუთიყუში. პროგრამამ უნდა გაიმეოროს რასაც ეტყვი მანამ სანამ არ
# შეიყვან სიტყვას quit, თუმცა წინ დაურთოს კითხვა „User Said Whaaat!?”
# თუ შევიყვანეთ სიტყვა Hello დაიბეჭდება
# „User Said Whaaat!?”
# “User Said Hello”

# ეს პირობა გავიგე ორნაირად. 
# ქვემოთ მოცემულ შემთხვევაში უბრალოდ სიტყვა შეგვყავს და თუთიყუში 
# ერთროულად ამბობს:
# „User Said Whaaat!?”
# “User Said Hello”

while True:

    word = input()
    
    if word == "quit":
        
        break
    
    else:

        print(f"User Said Whaat?!\nUser Said {word}") 


# ამ შემთვევაში კი ჯერ თუთიყუში გვეუბნება „User Said Whaaat!?”, მერე შეგვყვს სიტყვა
# და თუთიყუში იმეორებს. თუ შევიყვანთ quit, თუთიყუში არაფერს არ გაიმეორებს და
# პროგრამა დასრულდება.

while True:
    word = input("User Said Whaat!? ")
    
    if word == "quit":
        
        break
    
    else:

        print(f"User Said {word}") 