# დავალება 2

# შემსრულებელი: გიორგი ცუცირიძე

# ეს დავალება მოგვცეს მეორე ლექციაზე, რომელიც ჩატარდა 20231130-ში
# და დავალების ჩაბარების ბოლო ვადაა 20231206.


## 1. ვიქტორინა

# შეადგინე ვიქტორინის პროგრამა. მომხმარებელს უნდა დავუსვათ კითხვა: “რომელი
# იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?”
# სავარაუდო პასუხები: 

# 1. შუმერთა

# 2. სელჩუკთა

# 3. რომის

# 4. მონღოლთა

# მომხმარებელმა უნდა შეიყვანოს სწორი პასუხის ნომერი ან თავად სწორი პასუხი. 

# შეცდომის შემთხვევაში იბეჭდება: „არა! სწორი პასუხია რომის!“

# სწორი პასუხის შემთხვევაში იბეჭდება: „სწორია!“

answer = input("რომელი იმპერიის მიერ აგებული წყალ-მომარაგების სისტემა (აკვედუკი) ფუნქციონირებს დღესაც?"
               "\n1. შუმერთა\n2. სელჩუკთა\n3. რომის\n4. მონღოლთა\n"
               "შეიყვანეთ სწორი პასუხის ნომერი (1,2,3,4) ან თავად სწორი პასუხი.\n"
               "(ნებისმიერი შეცდომის შემთხვევაში თქვენი პასხი ჩაითვლება არასწორად): ")

if answer == "3" or answer == "რომის":
    print("სწორია!")
else:
    print("არა! სწორი პასუხია რომის!")

## 2. ონლაინ მაღაზია 

# პროგრამა გთავაზობს პროდუქტის სამ კატეგორიას. 
# მაგ.:

# 1. ლეპტოპები

# 2. პერსონალური კომპიუტერები

# 3. მობილურები

# მომხმარებელი ირჩევს ერთ-ერთს.
# პროგრამა ითხოვს მაქსიმალურ ბიუჯეტს და ბიუჯეტის მიხედვით სთავაზობს
# მომხმარებელს კონკრეტულ მოდელს არჩეულ კატეგორიაში. 
# 
# (თითო კატეგორიაში მინიმუმ 3 პროდუქტი მაინც უნდა იყოს)
# 
# თუ ბიუჯეტი ძალიან მცირეა, პროგრამა ბეჭდავს, რომ ამ თანხაში არ გააჩნია
# შემოთავაზება.

category = input("პროდუქტთა შემდეგი კატეგორიიდან აირჩიეთ ერთ-ერთი:"
                 "\n1. ლეპტოპები\n2. პერსონალური კომპიუტერები"
                 "\n3. მობილურები\nასარჩევად შეიყვანეთ კატეგორიის"
                 "\nშესაბამისი ნომერი: ")

while True:

    if not (category == "1" or category == "2" or category == "3"): 
        
        category = input("თქვენს მიერ არჩეული კატეგორია არ არსებობს. "
            "გთხოვთ სწორად შეიყვანოთ კატეგორიის შესაბამისი ნომერი: ")
    else:
        break
        
budget = input("შეიყვანეთ თქვენი მაქსიმალური ბიუჯეტი: ")

while True:

    try:
        budget = float(budget)
    except ValueError:
        budget = input("ბიუჯეტი უნდა იყოს რიცხვი (მთელი ან ათწილადი).\nგთხოვთ," 
                "კიდევ ერთხელ შეიყვანეთ თქვენი მაქსიმალური ბიუჯეტი: ")
    else:
        break

if category == "1":

    if budget < 1000:

        print("სამწუხაროდ, ამ თანხაში შემოთავაზება არ გაგვაჩნია.")
    
    elif 1000 <= budget < 3000:
    
        print("თქვენ შეგიძლიათ შეიძინოთ TouchScreen Acer Chromebook C738T")
    
    elif 3000 <= budget < 5000:
    
        print("თქვენ შეგიძლიათ შეიძინოთ Dell Latitude 14")
    
    elif budget >= 5000:
    
        print("თქვენ შეგიძლიათ შეიძინოთ MacBook Pro 15")

elif category =="2":

    if budget < 500:
    
        print("სამწუხაროდ, ამ თანხაში შემოთავაზება არ გაგვაჩნია.")
    
    elif 500 <= budget < 2000:
    
        print("თქვენ შეგიძლიათ შეიძინოთ Intel i3")
    
    elif 2000 <= budget < 5000:
    
        print("თქვენ შეგიძლიათ შეიძინოთ Intel i7")
    
    elif budget >= 5000:
    
        print("თქვენ შეგიძლიათ შეიძინოთ Intel i9")


else:
    
    if budget < 100:
    
        print("სამწუხაროდ, ამ თანხაში შემოთავაზება არ გაგვაჩნია.")
    
    elif 100 <= budget < 300:
    
        print("თქვენ შეგიძლიათ შეიძინოთ Nokia N73")
    
    elif 300 <= budget < 1000:
    
        print("თქვენ შეგიძლიათ შეიძინოთ Samsung Galaxy A51")
    
    elif budget >= 1000:
    
        print("თქვენ შეგიძლიათ შეიძინოთ Samsung Galaxy S5")


## 3. ქუესთის შედგენა (Text Based Adventure Game)

# დაწერე ერთმანეთში ჩასმული if-else კონსტრუქციების
# გამოყენებით მარტივი ტექსტზე დაფუძნებული სათავგადასავლო თამაში.
# მაგ. თავიდან პროგრამა ბეჭდავს მომხმარებლის ადგილსამყოფელს და სთავაზობს
# მქომედების რამდენიმე ვარიანტს. სხვადასხვა არჩევანის შემთხვევაში თამაში
# სხვადასხვანაირად ვითარდება.

direction = input(
    "თქვენ იმყოფებით მარტივ, მაგრამ საშიშ ლაბირინთში, რომელიც მდებარეობს კლდის ნაპირზე\n"
    "და გარშემორტყმულია ცხოველებით. თქვენ გაქვთ შანსი დააღწიოთ თავი ლაბირინთს.\n"
    "თუ ლაბირინთიდან ვერ გახვალთ გადაიჩეხებით კლდეზე ან შეგჭამენ ცხოველები და თამაში დასრულდება.\n"
    "მოცემული მდებარეობიდან თქვენ შეგიძლიათ წახვიდეთ ჩრდილოეთით, სამხრეთით, დასავლეთით და\n"
    "აღმოსავლეთით. მიმართულების ასარჩევად შეიყვანეთ შესაბამისი სიტყვა(\n"
    "ჩრდილოეთი, სამხრეთი, დასავლეთი ან აღმოსავლეთი): ")

while True:

    if not (direction == "ჩრდილოეთი" or direction == "სამხრეთი" or 
        direction == "დასავლეთი" or direction == "აღმოსავლეთი"):
        
        direction = input("გთხოვთ სწორად აირჩიოთ მიმართულება\n"
                        "(დასაშვებია მხოლოდ შემდეგი მიმართულებები: "
                        "ჩრდილოეთი, სამხრეთი, დასავლეთი ან აღმოსავლეთი): ")
    else:
        break

if direction == "ჩრდილოეთი":

    room_N_1 = input("თქვენ იმყოფებით ჩრდილოეთის ოთახ N1-ში.\n"
                     "ამ ოთახს აქვს 2 კარი, წითელი და მწვანე.\n"
                     "ერთი კარით გახვალთ ლაბირინთიდან, ხოლო მეორე კარით გადაიჩეხებით კლდეზე.\n"
                     "შეიყვანეთ კარის სახელი (მწვანე/წითელი): ")
    while True:

        if not (room_N_1 == "მწვანე" or room_N_1 == "წითელი"):
            
            room_N_1 = input("გთხოვთ სწორად აირჩიოთ კარის დასახელება\n"
                            "(დასაშვებია მხოლოდ შემდეგი დასახელებები: წითელი, მწვანე): ")
        else:
            break

    if room_N_1 == "მწვანე":
        
        print("გილოცავთ! თქვენ დააღწიეთ თავი ლაბირინთს და თავისუფალი ხართ!")
    
    else:

        print("სამწუხაროდ, თქვენ კლდიდან გადაიჩეხეთ.\n"
                   "თამაში დასრულებულია! თქვენ წააგეთ :(")
        
elif direction == "სამხრეთი":

    room_S_1 = input("თქვენ იმყოფებით სამხრეთის ოთახ N1-ში.\n"
                     "იმისათვის, რომ ამ ოთახიდან გასვლა მოახერხოთ\n"
                     "შეიყვანეთ იტალიის დედაქალაქის სახელი ლათინური ასოებით: ")
    
    if room_S_1 == "Rome":
        
        print("გილოცავთ! თქვენ დააღწიეთ თავი ლაბირინთს და თავისუფალი ხართ!")
    
    else:
        
        room_S_1 = input("თქვენ კიდევ ერთი შანსი გაქვთ გამოიცნოთ და შეიყვანოთ\n"
                         "ლათინური ასოებით იტალიის დედაქალაქი:")
        
        if room_S_1 == "Rome":
        
            print("გილოცავთ! თქვენ დააღწიეთ თავი ლაბირინთს და თავისუფალი ხართ!")
        
        else:

            print("სამწუხაროდ თქვენ ამ ლაბირინთიდან გასვლის შანსი არ გაქვთ :(\n"
                  "თამაში დასრულებულია! თქვენ წააგეთ :(")
  
elif direction == "დასავლეთი":

    room_W_1 = input("თქვენ იმყოფებით დასავლეთის ოთახ N1-ში.\n"
                   "ეს ოთახი გარშემორტყმულია ცხოველებით. თუ სწორად ჩაწერთ\n"
                   "ერთ ბაიტში რამდენი ბიტია, ყველა ცხოველი დაიხოცება, კედლები ჩამოინგრევა\n"
                   "და თქვენ გარეთ აღმოჩნდებით. თუ არასწორად შეიყვანთ რიცხვს ან შეყვანისას რაიმე შეგეშლებათ\n"
                   "კედლები ჩამოინგრევა, ცხოველები შემოცვივდებიან და შეგჭამენ. შეიყვანეთ რიცხვი: ")
    
    if room_W_1 == "8":

        print("გილოცავთ! თქვენ დააღწიეთ თავი ლაბირინთს და თავისუფალი ხართ!")
    
    else:

        print("სამწუაროდ თქვენ ლომმა შეგჭამათ, თქვენი ძვლები კი აფთრებმა მიირთვეს.\n"
              "თამაში დასრულებულია! თქვენ წააგეთ :(")

else:
    print("სამწუხაროდ, თქვენ კლდიდან გადაიჩეხეთ.\n"
                   "თამაში დასრულებულია! თქვენ წააგეთ :(")
    

## 4. მომხმარებლისთვის კარიერის შერჩევა (არასავალდებულო)

# პროგრამა უსვამს მომხმარებელს რამდენიმე კითხვას
# (თქვენი იმპროვიზაციით) და ურჩევს მისთვის შესაფერის
# პროფესიას

Q1_ans = input("რომელი საგანი გიყვართ ყველაზე მეტად?\n"
                  "1. ისტორია\n2. მათემატიკა\n"
                  "შეიყვანეთ შესაბამისი საგნის ნომერი: ")
while True:
    
    if not (Q1_ans == "1" or Q1_ans == "2"):
        
        Q1_ans = input("დასაშვებია მხოლოდ ნატურალური რიცხვები (1,2)\n"
                        "შეიყვანეთ შესაბამისი საგნის ნომერი: ")
    else:
        break

if Q1_ans == "1":
    
    Q1_1_ans = input("ფაქტების დამახსოვრება უფრო კარგად გამოგდით "
                     "თუ მოვლენების ანალიზი?\n1. ფაქტების დამახსოვრება\n"
                     "2. მოვლენების ანალიზი\nშეიყვანეთ პასუხის შესაბამისი"
                     "ნომერი: ")
    while True:

        if not (Q1_1_ans == "1" or Q1_1_ans == "2"):
            
            Q1_1_ans = input("დასაშვებია მხოლოდ ნატურალური რიცხვები (1,2)\n"
                            "შეიყვანეთ შესაბამისი ნომერი: ")
        else:
            break

    if Q1_1_ans == "1":
        
        print("თქვენ უნდა გახდეთ ჟამთაღმწერელი!")
    
    else:
    
        print("თქვენ უნდა გახდეთ პოლიტიკოსი!")
else:
    Q2_1_ans = input("რა უფრო მეტად მოგწონთ "
                     "\n1. არითმეტიკული ოპერაციების სწრაფად შესრულება თუ\n"
                     "2. დამტკიცებების კეთება\nშეიყვანეთ პასუხის შესაბამისი"
                     "ნომერი: ")
    while True:

        if not (Q2_1_ans == "1" or Q2_1_ans == "2"):
            
            Q2_1_ans = input("დასაშვებია მხოლოდ ნატურალური რიცხვები (1,2)\n"
                            "შეიყვანეთ შესაბამისი ნომერი: ")
        else:
            break

    if Q2_1_ans == "1":
        
        print("თქვენ უნდა გახდეთ კალკულატორი!")
    
    else:
    
        print("თქვენ უნდა გახდეთ მათემატიკოსი!")